'use strict';

/** TODO: можно вынести в отдельный файл data.js **/
const tasks = [
  {
    id: '1138465078061',
    completed: false,
    text: 'React',
  },
  {
    id: '1138465078062',
    completed: false,
    text: 'Redux',
  },
  {
    id: '1138465078063',
    completed: false,
    text: 'Немного отдохнуть...',
  },
];

const taskList = document.querySelector('.tasks-list');


/** TODO: подытог
 * правки, которые прописал - не критичны
 *
 * видно, что старался, код написан аккуратно и понятно, количество логики в приложении тоже радует - мне нравится!
 * пиздуй уже на работу! ❤️
 *
 * А если серьёзно, то было бы круто все подключить в один js файл и основную логику прописать там
 * а всё остальное так же было бы разделено по файлам. Если будет время, то вторым коммитом покажу как именно
 * **/